<?php

/**
 * 1093. 大样本统计
 * 我们对 0 到 255 之间的整数进行采样，并将结果存储在数组 count 中：count[k] 就是整数 k 的采样个数。

    我们以 浮点数 数组的形式，分别返回样本的最小值、最大值、平均值、中位数和众数。其中，众数是保证唯一的。

    我们先来回顾一下中位数的知识：

    如果样本中的元素有序，并且元素数量为奇数时，中位数为最中间的那个元素；
    如果样本中的元素有序，并且元素数量为偶数时，中位数为中间的两个元素的平均值。
 */
class Solution1093

{
    /**
     * @param Integer[] $count
     * @return Float[]
     */
    function sampleStats($count)
    {
        $min = -1;
        $sum = $total = $mode = $median = $max = $avg = 0;
        for ($i = 0; $i < 256; ++$i) {
            if ($count[$i] > 0) {
                $min = $i;
                break;
            }
        }

        for ($i = 255; $i >= 0; --$i) {
            if ($count[$i] > 0) {
                $max = $i;
                break;
            }
        }

        for ($i = 0; $i < 256; ++$i) {
            if ($count[$i] > 0) {
                $total += $count[$i];
                $sum += $i * $count[$i];
            }
        }
        $avg = $sum / $total;
        if ($total == 1) {
            $median = $sum;
        }

        // 不管奇数个还是偶数个，中位数都可以表示为以下两个数的平均数
        // 如一共有 4 个数字，中位数为第 2 和第 3 个数字的平均数
        // 如一共有 5 个数字，中位数为第 3 和第 3 数字的平均数
        $m1 = floor(($total + 1) / 2);
        $m2 = floor($total / 2 + 1);
        for ($i = 0, $cnt = 0; $total > 1 && $i < 256; ++$i) {
            if ($cnt < $m1 && $cnt + $count[$i] >= $m1) {
                $median += $i / 2;
            }

            if ($cnt < $m2 && $cnt + $count[$i] >= $m2) {
                $median += $i / 2;
            }
            $cnt += $count[$i];
        }

        arsort($count);
        $mode = key($count);

        return [$min, $max, $avg, $median, $mode];
    }
}

$count = [0, 1, 3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
var_dump((new Solution1093())->sampleStats($count)) . PHP_EOL;
